[
    
  {
    "bookId": 1,
    "bookName": "The Hunger Games",
    "author": "Suzanne Collins",
    "image": "https://i.ibb.co/4gJ89CW/hunger-1.png",
    "review": "Suzanne Collins' 'The Hunger Games' presents a gripping dystopian tale of survival, sacrifice, and rebellion against oppressive rule. Set in a bleak future, where children are forced to fight to the death in a televised spectacle, the novel explores themes of power, inequality, and resilience. With its fast-paced action and complex characters, it captivates readers from start to finish, leaving a lasting impact. Published in 2008 by Scholastic Corporation, 'The Hunger Games' quickly became a cultural phenomenon, inspiring a generation of readers with its powerful narrative and thought-provoking commentary.",
    "totalPages": 374,
    "rating": 4.6,
    "category": "Young Adult",
    "tags": ["Dystopia", "Action"],
    "publisher": "Scholastic Corporation",
    "yearOfPublishing": 2008
}
,
      {
        "bookId": 2,
        "bookName": "The Girl with the Dragon Tattoo",
        "author": "Stieg Larsson",
        "image": "https://i.ibb.co/kmqS921/girl-dragon-1.png",
        "review": "Stieg Larsson's 'The Girl with the Dragon Tattoo' presents an intricately woven plot alongside compelling characters, notably a fearless hacker and a determined journalist. Within this riveting mystery, suspenseful twists and turns keep readers engaged until the final page, cementing its place as a standout in the genre of suspenseful crime fiction. Larsson's masterful storytelling, coupled with the depth of his characters, creates an immersive experience that captivates readers throughout its 672 pages. Published in 2005 by Norstedts Förlag, this novel offers a thrilling journey into a world of suspense, investigation, and intrigue, leaving a lasting impression on those who dare to delve into its pages.",
        "totalPages": 672,
        "rating": 4.7,
        "category": "Mystery",
        "tags": ["Suspense", "Investigation"],
        "publisher": "Norstedts Förlag",
        "yearOfPublishing": 2005
    }
    ,
      {
        "bookId": 3,
        "bookName": "The Da Vinci Code",
        "author": "Dan Brown",
        "image": "https://i.ibb.co/3dcHVf0/vinci-code-1.png",
        "review": "Dan Brown's gripping thriller, 'The Da Vinci Code,' seamlessly blends art, history, and conspiracy into an exhilarating puzzle. Professor Robert Langdon's relentless quest for the Holy Grail is a high-stakes adventure that unfolds with gripping intensity. Filled with unexpected twists and shocking revelations, Brown keeps readers on the edge of their seats until the final revelation. As Langdon delves deeper into the secrets of the past, the intricate plot unravels, weaving together art, religion, and hidden messages. With its fast-paced narrative and intricate plot, 'The Da Vinci Code' is a mesmerizing journey that challenges perceptions and leaves readers questioning the truth.",
        "totalPages": 454,
        "rating": 4.3,
        "category": "Mystery Thriller",
        "tags": ["Thriller", "Conspiracy", "Art", "History"],
        "publisher": "Doubleday",
        "yearOfPublishing": 2003
    }
    ,
    
      {
        "bookId": 4,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.ibb.co/4mdm7WT/killa-1.png",
        "review": "Harper Lee's masterpiece, 'To Kill a Mockingbird,' delves into the complex issue of racial injustice with poignant prose. Through the moral journey of Atticus Finch, the novel confronts societal norms and explores compassion in a small Southern town. It remains a timeless classic that continues to resonate with readers, offering profound insights into humanity and the pursuit of justice. Lee's vivid storytelling and compelling characters make this novel a powerful exploration of social justice and coming-of-age themes, ensuring its enduring relevance in literature.",
        "totalPages": 281,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Social Justice", "Coming-of-age"],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960
    }
    ,
    {
      "bookId": 5,
      "bookName": "Pride and Prejudice",
      "author": "Jane Austen",
      "image": "https://i.ibb.co/TLYCpJB/pride-1.png",
      "review": "Jane Austen's 'Pride and Prejudice' is a timeless romance that skillfully navigates societal expectations with wit and charm. Elizabeth Bennet's journey challenges the prejudices and norms of 19th-century England, making it a tale of enduring relevance. With its memorable characters and sparkling dialogue, the novel remains a beloved classic, celebrated for its portrayal of love's triumph over pride and societal constraints. Austen's keen observations of human nature and the intricacies of relationships continue to captivate readers, ensuring the novel's place as a cornerstone of classic literature.",
      "totalPages": 279,
      "rating": 4.7,
      "category": "Classic Literature",
      "tags": ["Romance", "Regency Era"],
      "publisher": "T. Egerton, Whitehall",
      "yearOfPublishing": 1813
  }
  ,
    {
      "bookId": 6,
      "bookName": "1984",
      "author": "George Orwell",
      "image": "https://i.ibb.co/khZ0sN2/1984-1.png",
      "review": "George Orwell's '1984' presents a chilling portrayal of totalitarianism, captivating readers with its dystopian vision. Set in a surveillance state, it delves into themes of oppression and individuality, warning of the dangers of unchecked authority. Winston's rebellion against Big Brother offers a compelling narrative that resonates with readers, making it a haunting and thought-provoking classic. Orwell's masterful storytelling and prophetic insights continue to captivate audiences, inspiring reflection on societal structures and the erosion of freedom. '1984' remains as relevant today as it was upon its publication in 1949, serving as a stark reminder of the importance of safeguarding democratic principles.",
      "totalPages": 328,
      "rating": 4.8,
      "category": "Science Fiction",
      "tags": ["Dystopia", "Totalitarianism"],
      "publisher": "Secker & Warburg",
      "yearOfPublishing": 1949
  }
  ,
    {
      "bookId": 7,
      "bookName": "The Great Gatsby",
      "author": "F. Scott Fitzgerald",
      "image": "https://i.ibb.co/qx4BVcR/great-1.png",
      "review": "F. Scott Fitzgerald's Jazz Age masterpiece, 'The Great Gatsby,' dazzles with its portrayal of the corruption of the American Dream. Through the enigmatic Jay Gatsby's pursuit of the elusive Daisy Buchanan, the novel exposes the emptiness of wealth and societal decadence. With its lyrical prose and tragic allure, it remains a poignant commentary on the fleeting nature of happiness and the moral decay of the Roaring Twenties. Fitzgerald's exploration of love, ambition, and disillusionment continues to captivate readers, making 'The Great Gatsby' an enduring classic of literature.",
      "totalPages": 218,
      "rating": 4.6,
      "category": "Classic Literature",
      "tags": ["Roaring Twenties", "Tragedy"],
      "publisher": "Charles Scribner's Sons",
      "yearOfPublishing": 1925
  },
  
  
    {
      "bookId": 8,
      "bookName": "The Catcher in the Rye",
      "author": "J.D. Salinger",
      "image": "https://i.ibb.co/q0zCccK/ctcher-1.png",
      "review": "J.D. Salinger's iconic novel, 'The Catcher in the Rye,' captures the disillusionment of youth with unparalleled authenticity. Through the rebellious odyssey of Holden Caulfield, it delves into themes of alienation and identity. Its raw honesty and candid narration continue to resonate, making it a defining work of 20th-century literature. Salinger's portrayal of adolescence and the search for authenticity remains as relevant today as it was upon its publication in 1951, cementing its status as a classic in literature.",
      "totalPages": 277,
      "rating": 4.4,
      "category": "Classic Literature",
      "tags": ["Adolescence", "Identity"],
      "publisher": "Little, Brown and Company",
      "yearOfPublishing": 1951
  }
  ,
    {
      "bookId": 9,
      "bookName": "The Hobbit",
      "author": "J.R.R. Tolkien",
      "image": "https://i.ibb.co/xGKZHBb/hobbit-1.png",
      "review": "J.R.R. Tolkien's 'The Hobbit' takes readers on an unforgettable journey with Bilbo Baggins as he embarks on an unexpected adventure to reclaim treasure guarded by the fearsome dragon, Smaug. Filled with thrilling encounters, magical landscapes, and unforgettable characters, this timeless tale serves as a captivating prelude to Tolkien's epic masterpiece, The Lord of the Rings. With its richly imagined world and themes of courage, friendship, and the lure of the unknown, 'The Hobbit' continues to enchant readers of all ages, cementing its place as a classic of fantasy literature.",
      "totalPages": 310,
      "rating": 4.7,
      "category": "Fantasy",
      "tags": ["Adventure", "Quest"],
      "publisher": "George Allen & Unwin",
      "yearOfPublishing": 1937
  }
  
  ,
    {
      "bookId": 10,
      "bookName": "The Road",
      "author": "Cormac McCarthy",
      "image": "https://i.ibb.co/bWyhQdF/road-1.png",
      "review": "Cormac McCarthy's 'The Road' is a haunting post-apocalyptic journey of a father and son, navigating a desolate landscape fraught with danger and despair. Through sparse yet evocative prose, McCarthy explores themes of survival, resilience, and the enduring bond between parent and child. The stark, unforgiving world he creates serves as a backdrop for profound meditations on humanity and the essence of hope. With its raw emotional power and unflinching portrayal of the human spirit, 'The Road' is a testament to McCarthy's mastery of storytelling, leaving readers haunted by its imagery long after the final page is turned.",
      "totalPages": 287,
      "rating": 4.4,
      "category": "Fiction",
      "tags": ["Post-apocalyptic", "Fatherhood"],
      "publisher": "Alfred A. Knopf",
      "yearOfPublishing": 2006
  },
  {
    "bookId": 11,
    "bookName": "The Last Magician",
    "author": "Lisa Maxwell",
    "image": "https://i.ibb.co/c2jmrhL/magician-1.png",
    "review": "Lisa Maxwell's 'The Last Magician' weaves a mesmerizing tale of magic and deception in historical New York. As gritty as it is enchanting, the story follows a daring heist amidst a world of secrets and betrayal. Maxwell masterfully blends elements of fantasy and suspense, keeping readers on the edge of their seats until the last page. With richly drawn characters and a vividly depicted setting, 'The Last Magician' is a captivating adventure that will leave readers spellbound. It's a testament to Maxwell's skill in crafting intricate plots and immersive worlds that resonate with readers of all ages.",
    "totalPages": 500,
    "rating": 4.7,
    "category": "Young Adult",
    "tags": ["Magic", "Heist"],
    "publisher": "Spellbound Books",
    "yearOfPublishing": 2018
}
,
    {
      "bookId": 12,
      "bookName": "The Forgotten Garden",
      "author": "Kate Morton",
      "image": "https://i.ibb.co/3khWZcz/forgotten-1.png",
      "review": "Kate Morton's 'The Forgotten Garden' is a mesmerizing tale of secrets and memories that spans across continents and generations. Set in a lush garden brimming with hidden truths, the narrative weaves through time, unraveling mysteries layer by layer. Morton's evocative prose paints vivid landscapes while delving into the complexities of human connections and the enduring power of family ties. With its richly drawn characters and suspenseful plot, this historical mystery captivates from start to finish, leaving readers spellbound by its enchanting blend of history, intrigue, and emotion. 'The Forgotten Garden' is a masterfully crafted story that lingers in the mind long after the final page is turned.",
      "totalPages": 560,
      "rating": 4.9,
      "category": "Historical Mystery",
      "tags": ["Secrets", "Garden"],
      "publisher": "Timeless Tales",
      "yearOfPublishing": 2022
    }
  ]
  